assessments-750/sample-lesson/LessonReflection.tex
% Created 2021-04-12 Mon 20:19
% Intended LaTeX compiler: pdflatex
\documentclass{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{hyperref}
\usepackage{natbib}
\usepackage{amssymb}
\usepackage{amsmath}
\usepackage{geometry}
\usepackage[english]{babel}
\setlength{\parindent}{4em}
\setlength{\parskip}{1em}
\setcounter{secnumdepth}{0}
\geometry{a4paper,left=2.5cm,top=2cm,right=2.5cm,bottom=2cm,marginparsep=7pt, marginparwidth=.6in}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\author{Curtis D'Alves}
\date{April 12, 2021}
\title{Intro To Un*x Systems and Bash Scripting: Lesson Reflection}
\hypersetup{
 pdfauthor={Curtis D'Alves},
 pdftitle={Intro To Un*x Systems and Bash Scripting: Lesson Reflection},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
I was a little skeptical of the rigidity of the BOPPPS model initially whoever
after finishing developing the lesson and receiving feedback I see it's value. I
have never spent that much time preparing a lesson beforehand, preferring to
create and revise lessons on the fly. I probably shouldn't be that surprised
that any extra level of organization will help improve over that. However I have
actually come to believe the BOPPPS model provides more than just any lesson
plan that would improve organization. In particular I think identifying learning
outcomes and giving an overview of what they are in the bridge is a great way to
start a lesson that assures students of what is trying to be accomplished and
that their time is not being wasted. It also inspired me to structure my lesson
into clearly divided sections that distribute learning outcomes and provide
assessment for them at the end of each section, which is a technique that may be
too structured for some lessons but was very effective for this one. If I were
to improve upon the lesson, I would supplement the lesson by making a more
sophisticated pre-assessment that identifies what pre-existing knowledge is
required and providing resources for learning that knowledge. I would also have
a better summary at the end of each section with a list of key commands (thanks
for my partner for providing this suggestion as feedback, it's a great idea).
\end{document}